<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"87445020484fb99beb9c448d68b492f8213c673cec02ed2408c7d537a3c13b0f","plan_job_ref":"Job Create terraform plan #49 at https://github.com/presentium/infrastructure/actions/runs/10513058882","plan_hash":"99f34215ee8a0b789d062722b172f5e04ff2ececcab7157c28f1014ec2a48375","plan_text_format":"diff","version":"1.44.0","plan_out_hash":"df9a2a89e2bc9b8e0008e643f661c380bbad15f9254fecd00e387223f5de2ced"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.kubernetes_storage_class_v1.ebs will be created
+   resource "kubernetes_storage_class_v1" "ebs" {
+       allow_volume_expansion = true
+       id                     = (known after apply)
+       parameters             = {
+           "tagSpecification1" = "Managed_by=aws-ebs-csi-driver"
        }
+       reclaim_policy         = "Retain"
+       storage_provisioner    = "ebs.csi.aws.com"
+       volume_binding_mode    = "WaitForFirstConsumer"

+       metadata {
+           generation       = (known after apply)
+           name             = "ebs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0] will be created
+   resource "aws_iam_policy" "ebs_csi" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to manage EBS volumes via the container storage interface driver"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "AmazonEKS_EBS_CSI_Policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:EnableFastSnapshotRestores",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               "kms:GrantIsForAWSResource" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
+                   {
+                       Action   = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "*******************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-EBS-CSI-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0] will be created
+   resource "aws_iam_role_policy_attachment" "ebs_csi" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-EBS-CSI-PRESENTIUM"
    }

  # module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "aws-ebs-csi-driver"
+       addon_version               = "v1.33.0-eksbuild.1"
+       arn                         = (known after apply)
+       cluster_name                = "presentium"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       service_account_role_arn    = (known after apply)
+       tags                        = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all                    = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }

+       timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #49](https://github.com/presentium/infrastructure/actions/runs/10513058882)